docs/architecture/observed/dune-libraries.dot
digraph G {
  compound=true;
  "kairos" [shape=diamond, ];
  "kairos_lsp" [shape=diamond, ];
  "astring" [style="filled", ];
  "bos" [style="filled", ];
  "zip" [style="filled", ];
  "cmdliner" [style="filled", ];
  "fmt" [style="filled", ];
  "fpath" [style="filled", ];
  "gen" [style="filled", ];
  "jsonrpc" [style="filled", ];
  "logs" [style="filled", ];
  "logs.fmt" [style="filled", ];
  "lsp" [style="filled", ];
  "menhirLib" [style="filled", ];
  "ocaml-compiler-libs.common" [style="filled", ];
  "ocaml-compiler-libs.shadow" [style="filled", ];
  "parsexp" [style="filled", ];
  "ppx_derivers" [style="filled", ];
  "ppx_deriving.api" [style="filled", ];
  "ppx_deriving.runtime" [style="filled", ];
  "ppx_deriving.show" [style="filled", ];
  "ppx_deriving_yojson" [style="filled", ];
  "ppx_deriving_yojson.runtime" [style="filled", ];
  "ppx_yojson_conv_lib" [style="filled", ];
  "ppxlib" [style="filled", ];
  "ppxlib.ast" [style="filled", ];
  "ppxlib.astlib" [style="filled", ];
  "ppxlib.print_diff" [style="filled", ];
  "ppxlib.stdppx" [style="filled", ];
  "ppxlib.traverse_builtins" [style="filled", ];
  "rresult" [style="filled", ];
  "sedlex" [style="filled", ];
  "sedlex.ppx" [style="filled", ];
  "sedlex.utils" [style="filled", ];
  "seq" [style="filled", ];
  "sexplib" [style="filled", ];
  "sexplib0" [style="filled", ];
  "stdlib-shims" [style="filled", ];
  "uutf" [style="filled", ];
  "why3" [style="filled", ];
  "yojson" [style="filled", ];
  "zarith" [style="filled", ];
  "compiler-libs" [style="filled", ];
  "compiler-libs.common" [style="filled", ];
  "dynlink" [style="filled", ];
  "str" [style="filled", ];
  "unix" [style="filled", ];
  "kairos-automata-contract";
  "kairos-graphviz-adapter";
  "kairos-lsp.app";
  "kairos-lsp.protocol";
  "kairos-proof-contract";
  "kairos-spot-adapter";
  "kairos-telemetry.runtime";
  "kairos-why3-adapter.runtime";
  "kairos.domain_core";
  "kairos.domain_proof_export";
  "kairos.domain_verification";
  "kairos.engine";
  "kairos.internal.application";
  "kairos.internal.artifact_graph_render";
  "kairos.internal.artifact_text_render";
  "kairos.internal.c_codegen";
  "kairos.internal.composition";
  "kairos.internal.input_lang";
  "kairos.internal.runtime_automata";
  "kairos.internal.runtime_core";
  "kairos.internal.runtime_diagnostics";
  "kairos.internal.runtime_outputs";
  "kairos.internal.runtime_proof";
  "kairos.internal.verification_runtime";
  "kairos.internal.why3";
  "kairos.internal.why3_compile";
  "kairos.internal.why3_contracts";
  "kairos.internal.why3_expr";
  "kairos.internal.why3_render";
  "kairos.internal.why3_runtime_view";
  "kairos.observation_model";
  "kairos.sequential_ir";
  "kairos.shared";
  "kairos.verification_unit";
  "local_package__" [label="", height=0.000000, width=0.000000,
                     fixedsize=true, style="invis", ];

  subgraph cluster_105050893 { label="ppx_derivers 1.2.1"; "ppx_derivers";
     };
  subgraph cluster_129913994 { label="(compiler)"; "unix";"str";"dynlink";"compiler-libs.common";"compiler-libs";
     };
  subgraph cluster_131039579 { label="uutf 1.0.4"; "uutf";
     };
  subgraph cluster_292359173 { label="astring 0.8.5"; "astring";
     };
  subgraph cluster_308410071 { label="ppx_yojson_conv_lib v0.17.0"; "ppx_yojson_conv_lib";
     };
  subgraph cluster_315429389 { label="ppxlib 0.38.0"; "ppxlib.traverse_builtins";"ppxlib.stdppx";"ppxlib.print_diff";"ppxlib.astlib";"ppxlib.ast";"ppxlib";
     };
  subgraph cluster_362371254 { label="menhirLib 20260209"; "menhirLib";
     };
  subgraph cluster_438175530 { label="fpath 0.7.3"; "fpath";
     };
  subgraph cluster_458205106 { label="seq base"; "seq";
     };
  subgraph cluster_487364673 { label="ocaml-compiler-libs v0.17.0"; "ocaml-compiler-libs.shadow";"ocaml-compiler-libs.common";
     };
  subgraph cluster_488651423 { label="lsp 1.26.0"; "lsp";
     };
  subgraph cluster_496627304 { label="sedlex 3.7"; "sedlex.utils";"sedlex.ppx";"sedlex";
     };
  subgraph cluster_540379587 { label="gen 1.1"; "gen";
     };
  subgraph cluster_580413441 { label="jsonrpc 1.26.0"; "jsonrpc";
     };
  subgraph cluster_58692198 { label="zarith 1.14"; "zarith";
     };
  subgraph cluster_591990434 { label="bos 0.2.1"; "bos";
     };
  subgraph cluster_641104511 { label="cmdliner 1.3.0"; "cmdliner";
     };
  subgraph cluster_677165808 { label="logs 0.10.0"; "logs.fmt";"logs";
     };
  subgraph cluster_692678782 { label="fmt 0.11.0"; "fmt";
     };
  subgraph cluster_696859669 { label="sexplib0 v0.17.0"; "sexplib0";
     };
  subgraph cluster_71904234 { label="why3 1.8.2"; "why3";
     };
  subgraph cluster_747883779 { label="stdlib-shims 0.3.0"; "stdlib-shims";
     };
  subgraph cluster_750503062 { label="sexplib v0.17.0"; "sexplib";
     };
  subgraph cluster_759172555 { label="ppx_deriving 6.1.1"; "ppx_deriving.show";"ppx_deriving.runtime";"ppx_deriving.api";
     };
  subgraph cluster_766362805 { label="rresult 0.7.0"; "rresult";
     };
  subgraph cluster_830443160 { label="parsexp v0.17.0"; "parsexp";
     };
  subgraph cluster_899750038 { label="ppx_deriving_yojson 3.10.0"; "ppx_deriving_yojson.runtime";"ppx_deriving_yojson";
     };
  subgraph cluster_902546259 { label="(local)"; "local_package__";"kairos.verification_unit";"kairos.shared";"kairos.sequential_ir";"kairos.observation_model";"kairos.internal.why3_runtime_view";"kairos.internal.why3_render";"kairos.internal.why3_expr";"kairos.internal.why3_contracts";"kairos.internal.why3_compile";"kairos.internal.why3";"kairos.internal.verification_runtime";"kairos.internal.runtime_proof";"kairos.internal.runtime_outputs";"kairos.internal.runtime_diagnostics";"kairos.internal.runtime_core";"kairos.internal.runtime_automata";"kairos.internal.input_lang";"kairos.internal.composition";"kairos.internal.c_codegen";"kairos.internal.artifact_text_render";"kairos.internal.artifact_graph_render";"kairos.internal.application";"kairos.engine";"kairos.domain_verification";"kairos.domain_proof_export";"kairos.domain_core";"kairos-why3-adapter.runtime";"kairos-telemetry.runtime";"kairos-spot-adapter";"kairos-proof-contract";"kairos-lsp.protocol";"kairos-lsp.app";"kairos-graphviz-adapter";"kairos-automata-contract";"kairos_lsp";"kairos";
     };
  subgraph cluster_916651657 { label="camlzip 1.14"; "zip";
     };
  subgraph cluster_959336548 { label="yojson 3.0.0"; "yojson";
     };

  "kairos" -> "cmdliner";
  "kairos" -> "kairos.engine";
  "kairos_lsp" -> "lsp";
  "kairos_lsp" -> "kairos-lsp.app";
  "bos" -> "fmt";
  "bos" -> "fpath";
  "bos" -> "logs";
  "bos" -> "rresult";
  "bos" -> "unix";
  "zip" -> "unix";
  "fpath" -> "astring";
  "gen" -> "seq";
  "jsonrpc" -> "yojson";
  "logs.fmt" -> "fmt";
  "logs.fmt" -> "logs";
  "lsp" -> "jsonrpc";
  "lsp" -> "ppx_yojson_conv_lib";
  "lsp" -> "uutf";
  "ocaml-compiler-libs.common" -> "compiler-libs.common";
  "parsexp" -> "sexplib0";
  "ppx_deriving.api" -> "ppxlib";
  "ppx_deriving.show" -> "ppx_deriving.api";
  "ppx_deriving_yojson" -> "ppx_deriving.api";
  "ppx_deriving_yojson.runtime" -> "ppx_deriving.runtime";
  "ppx_yojson_conv_lib" -> "yojson";
  "ppxlib" -> "ocaml-compiler-libs.shadow";
  "ppxlib" -> "ppx_derivers";
  "ppxlib" -> "ppxlib.ast";
  "ppxlib" -> "ppxlib.print_diff";
  "ppxlib" -> "ppxlib.stdppx";
  "ppxlib" -> "ppxlib.traverse_builtins";
  "ppxlib.ast" -> "ppxlib.astlib";
  "ppxlib.ast" -> "stdlib-shims";
  "ppxlib.astlib" -> "ocaml-compiler-libs.common";
  "ppxlib.stdppx" -> "sexplib0";
  "ppxlib.stdppx" -> "stdlib-shims";
  "sedlex" -> "gen";
  "sedlex.ppx" -> "ppxlib";
  "sedlex.ppx" -> "sedlex";
  "sedlex.ppx" -> "sedlex.utils";
  "sexplib" -> "parsexp";
  "why3" -> "zip";
  "why3" -> "menhirLib";
  "why3" -> "sexplib";
  "why3" -> "zarith";
  "why3" -> "dynlink";
  "why3" -> "str";
  "compiler-libs.common" -> "compiler-libs";
  "kairos-automata-contract" -> "ppx_deriving_yojson.runtime";
  "kairos-automata-contract" -> "yojson";
  "kairos-graphviz-adapter" -> "bos";
  "kairos-lsp.app" -> "kairos-lsp.protocol";
  "kairos-lsp.app" -> "kairos.engine";
  "kairos-lsp.protocol" -> "ppx_deriving_yojson.runtime";
  "kairos-lsp.protocol" -> "yojson";
  "kairos-proof-contract" -> "ppx_deriving_yojson.runtime";
  "kairos-proof-contract" -> "yojson";
  "kairos-spot-adapter" -> "unix";
  "kairos-spot-adapter" -> "kairos-automata-contract";
  "kairos-telemetry.runtime" -> "unix";
  "kairos-why3-adapter.runtime" -> "why3";
  "kairos-why3-adapter.runtime" -> "kairos-proof-contract";
  "kairos-why3-adapter.runtime" -> "kairos-telemetry.runtime";
  "kairos.domain_core" -> "logs.fmt";
  "kairos.domain_core" -> "ppx_deriving_yojson.runtime";
  "kairos.domain_core" -> "yojson";
  "kairos.domain_proof_export" -> "kairos.domain_verification";
  "kairos.domain_verification" -> "kairos.domain_core";
  "kairos.engine" -> "kairos.internal.c_codegen";
  "kairos.engine" -> "kairos.internal.composition";
  "kairos.internal.application" -> "kairos.domain_core";
  "kairos.internal.application" -> "kairos.shared";
  "kairos.internal.artifact_graph_render" -> "kairos.domain_verification";
  "kairos.internal.artifact_text_render" -> "kairos.domain_core";
  "kairos.internal.c_codegen" -> "kairos.domain_core";
  "kairos.internal.composition" -> "kairos.internal.input_lang";
  "kairos.internal.composition" -> "kairos.internal.verification_runtime";
  "kairos.internal.input_lang" -> "menhirLib";
  "kairos.internal.input_lang" -> "sedlex";
  "kairos.internal.input_lang" -> "kairos.internal.application";
  "kairos.internal.runtime_automata" -> "kairos-spot-adapter";
  "kairos.internal.runtime_automata" -> "kairos-telemetry.runtime";
  "kairos.internal.runtime_automata" -> "kairos.domain_verification";
  "kairos.internal.runtime_automata" -> "kairos.internal.application";
  "kairos.internal.runtime_core" -> "kairos-telemetry.runtime";
  "kairos.internal.runtime_core" -> "kairos.domain_verification";
  "kairos.internal.runtime_core" -> "kairos.internal.application";
  "kairos.internal.runtime_diagnostics" -> "kairos.domain_proof_export";
  "kairos.internal.runtime_diagnostics" -> "kairos.internal.artifact_graph_render";
  "kairos.internal.runtime_diagnostics" -> "kairos.internal.runtime_core";
  "kairos.internal.runtime_outputs" -> "kairos-graphviz-adapter";
  "kairos.internal.runtime_outputs" -> "kairos.internal.runtime_diagnostics";
  "kairos.internal.runtime_outputs" -> "kairos.internal.runtime_proof";
  "kairos.internal.runtime_proof" -> "kairos.internal.application";
  "kairos.internal.runtime_proof" -> "kairos.internal.why3";
  "kairos.internal.verification_runtime" -> "kairos.internal.artifact_text_render";
  "kairos.internal.verification_runtime" -> "kairos.internal.runtime_automata";
  "kairos.internal.verification_runtime" -> "kairos.internal.runtime_outputs";
  "kairos.internal.why3" -> "kairos-why3-adapter.runtime";
  "kairos.internal.why3" -> "kairos.internal.why3_render";
  "kairos.internal.why3_compile" -> "kairos-telemetry.runtime";
  "kairos.internal.why3_compile" -> "kairos.internal.why3_contracts";
  "kairos.internal.why3_contracts" -> "kairos.internal.why3_expr";
  "kairos.internal.why3_contracts" -> "kairos.internal.why3_runtime_view";
  "kairos.internal.why3_expr" -> "why3";
  "kairos.internal.why3_expr" -> "kairos.domain_core";
  "kairos.internal.why3_render" -> "kairos.internal.why3_compile";
  "kairos.internal.why3_runtime_view" -> "kairos.domain_verification";
  "kairos.observation_model" -> "kairos.sequential_ir";
  "kairos.sequential_ir" -> "ppx_deriving_yojson.runtime";
  "kairos.sequential_ir" -> "yojson";
  "kairos.shared" -> "unix";
  "kairos.verification_unit" -> "kairos.observation_model";

  }
