docs/architecture/observed/dune-libraries.mmd
flowchart TD

  subgraph 105050893 ["ppx_derivers 1.2.1"]
    id469005569(["ppx_derivers"])
    style id469005569 fill:#BBB
  end
  subgraph 129913994 ["(compiler)"]
    id445558595(["unix"])
    style id445558595 fill:#BBB
    id813421022(["str"])
    style id813421022 fill:#BBB
    id955311961(["dynlink"])
    style id955311961 fill:#BBB
    id499228351(["compiler-libs.common"])
    style id499228351 fill:#BBB
    id939231628(["compiler-libs"])
    style id939231628 fill:#BBB
  end
  subgraph 131039579 ["uutf 1.0.4"]
    id1002314104(["uutf"])
    style id1002314104 fill:#BBB
  end
  subgraph 292359173 ["astring 0.8.5"]
    id5035321(["astring"])
    style id5035321 fill:#BBB
  end
  subgraph 308410071 ["ppx_yojson_conv_lib v0.17.0"]
    id236849345(["ppx_yojson_conv_lib"])
    style id236849345 fill:#BBB
  end
  subgraph 315429389 ["ppxlib 0.38.0"]
    id13861918(["ppxlib.traverse_builtins"])
    style id13861918 fill:#BBB
    id617364069(["ppxlib.stdppx"])
    style id617364069 fill:#BBB
    id262402277(["ppxlib.print_diff"])
    style id262402277 fill:#BBB
    id176976980(["ppxlib.astlib"])
    style id176976980 fill:#BBB
    id98711372(["ppxlib.ast"])
    style id98711372 fill:#BBB
    id793200189(["ppxlib"])
    style id793200189 fill:#BBB
  end
  subgraph 362371254 ["menhirLib 20260209"]
    id550106276(["menhirLib"])
    style id550106276 fill:#BBB
  end
  subgraph 438175530 ["fpath 0.7.3"]
    id359279316(["fpath"])
    style id359279316 fill:#BBB
  end
  subgraph 458205106 ["seq base"]
    id77802623(["seq"])
    style id77802623 fill:#BBB
  end
  subgraph 487364673 ["ocaml-compiler-libs v0.17.0"]
    id525327960(["ocaml-compiler-libs.shadow"])
    style id525327960 fill:#BBB
    id1006162927(["ocaml-compiler-libs.common"])
    style id1006162927 fill:#BBB
  end
  subgraph 488651423 ["lsp 1.26.0"]
    id312940537(["lsp"])
    style id312940537 fill:#BBB
  end
  subgraph 496627304 ["sedlex 3.7"]
    id356865720(["sedlex.utils"])
    style id356865720 fill:#BBB
    id232455684(["sedlex.ppx"])
    style id232455684 fill:#BBB
    id615927850(["sedlex"])
    style id615927850 fill:#BBB
  end
  subgraph 540379587 ["gen 1.1"]
    id254130227(["gen"])
    style id254130227 fill:#BBB
  end
  subgraph 580413441 ["jsonrpc 1.26.0"]
    id164759162(["jsonrpc"])
    style id164759162 fill:#BBB
  end
  subgraph 58692198 ["zarith 1.14"]
    id479941517(["zarith"])
    style id479941517 fill:#BBB
  end
  subgraph 591990434 ["bos 0.2.1"]
    id1060604959(["bos"])
    style id1060604959 fill:#BBB
  end
  subgraph 641104511 ["cmdliner 1.3.0"]
    id746976749(["cmdliner"])
    style id746976749 fill:#BBB
  end
  subgraph 677165808 ["logs 0.10.0"]
    id901935611(["logs.fmt"])
    style id901935611 fill:#BBB
    id513878372(["logs"])
    style id513878372 fill:#BBB
  end
  subgraph 692678782 ["fmt 0.11.0"]
    id475016005(["fmt"])
    style id475016005 fill:#BBB
  end
  subgraph 696859669 ["sexplib0 v0.17.0"]
    id903959837(["sexplib0"])
    style id903959837 fill:#BBB
  end
  subgraph 71904234 ["why3 1.8.2"]
    id378552737(["why3"])
    style id378552737 fill:#BBB
  end
  subgraph 747883779 ["stdlib-shims 0.3.0"]
    id394632140(["stdlib-shims"])
    style id394632140 fill:#BBB
  end
  subgraph 750503062 ["sexplib v0.17.0"]
    id683807590(["sexplib"])
    style id683807590 fill:#BBB
  end
  subgraph 759172555 ["ppx_deriving 6.1.1"]
    id119084129(["ppx_deriving.show"])
    style id119084129 fill:#BBB
    id77953020(["ppx_deriving.runtime"])
    style id77953020 fill:#BBB
    id55340172(["ppx_deriving.api"])
    style id55340172 fill:#BBB
  end
  subgraph 766362805 ["rresult 0.7.0"]
    id987760472(["rresult"])
    style id987760472 fill:#BBB
  end
  subgraph 830443160 ["parsexp v0.17.0"]
    id701524681(["parsexp"])
    style id701524681 fill:#BBB
  end
  subgraph 899750038 ["ppx_deriving_yojson 3.10.0"]
    id951852321(["ppx_deriving_yojson.runtime"])
    style id951852321 fill:#BBB
    id21108445(["ppx_deriving_yojson"])
    style id21108445 fill:#BBB
  end
  subgraph 902546259 ["(local)"]

    id360346707(["kairos.verification_unit"])
    id41381939(["kairos.shared"])
    id667085455(["kairos.sequential_ir"])
    id745393601(["kairos.observation_model"])
    id818182390(["kairos.internal.why3_runtime_view"])
    id1012753001(["kairos.internal.why3_render"])
    id143033156(["kairos.internal.why3_expr"])
    id831551540(["kairos.internal.why3_contracts"])
    id61037662(["kairos.internal.why3_compile"])
    id363607354(["kairos.internal.why3"])
    id356889899(["kairos.internal.verification_runtime"])
    id835658494(["kairos.internal.runtime_proof"])
    id902833893(["kairos.internal.runtime_outputs"])
    id476194349(["kairos.internal.runtime_diagnostics"])
    id385947710(["kairos.internal.runtime_core"])
    id248638701(["kairos.internal.runtime_automata"])
    id16686930(["kairos.internal.input_lang"])
    id962147077(["kairos.internal.composition"])
    id614824427(["kairos.internal.c_codegen"])
    id958243360(["kairos.internal.artifact_text_render"])
    id266353272(["kairos.internal.artifact_graph_render"])
    id1070284156(["kairos.internal.application"])
    id97846301(["kairos.engine"])
    id930986246(["kairos.domain_verification"])
    id35199649(["kairos.domain_proof_export"])
    id1025403665(["kairos.domain_core"])
    id798752935(["kairos-why3-adapter.runtime"])
    id458148623(["kairos-telemetry.runtime"])
    id953615773(["kairos-spot-adapter"])
    id356887988(["kairos-proof-contract"])
    id1072327609(["kairos-lsp.protocol"])
    id890026226(["kairos-lsp.app"])
    id1017323711(["kairos-graphviz-adapter"])
    id590397133(["kairos-automata-contract"])
    id839032564{"kairos_lsp"}
    id976590762{"kairos"}
  end
  subgraph 916651657 ["camlzip 1.14"]
    id356777939(["zip"])
    style id356777939 fill:#BBB
  end
  subgraph 959336548 ["yojson 3.0.0"]
    id268189549(["yojson"])
    style id268189549 fill:#BBB
  end
  id976590762-->id746976749
  id976590762-->id97846301
  id839032564-->id312940537
  id839032564-->id890026226
  id1060604959-->id475016005
  id1060604959-->id359279316
  id1060604959-->id513878372
  id1060604959-->id987760472
  id1060604959-->id445558595
  id356777939-->id445558595
  id359279316-->id5035321
  id254130227-->id77802623
  id164759162-->id268189549
  id901935611-->id475016005
  id901935611-->id513878372
  id312940537-->id164759162
  id312940537-->id236849345
  id312940537-->id1002314104
  id1006162927-->id499228351
  id701524681-->id903959837
  id55340172-->id793200189
  id119084129-->id55340172
  id21108445-->id55340172
  id951852321-->id77953020
  id236849345-->id268189549
  id793200189-->id525327960
  id793200189-->id469005569
  id793200189-->id98711372
  id793200189-->id262402277
  id793200189-->id617364069
  id793200189-->id13861918
  id98711372-->id176976980
  id98711372-->id394632140
  id176976980-->id1006162927
  id617364069-->id903959837
  id617364069-->id394632140
  id615927850-->id254130227
  id232455684-->id793200189
  id232455684-->id615927850
  id232455684-->id356865720
  id683807590-->id701524681
  id378552737-->id356777939
  id378552737-->id550106276
  id378552737-->id683807590
  id378552737-->id479941517
  id378552737-->id955311961
  id378552737-->id813421022
  id499228351-->id939231628
  id590397133-->id951852321
  id590397133-->id268189549
  id1017323711-->id1060604959
  id890026226-->id1072327609
  id890026226-->id97846301
  id1072327609-->id951852321
  id1072327609-->id268189549
  id356887988-->id951852321
  id356887988-->id268189549
  id953615773-->id445558595
  id953615773-->id590397133
  id458148623-->id445558595
  id798752935-->id378552737
  id798752935-->id356887988
  id798752935-->id458148623
  id1025403665-->id901935611
  id1025403665-->id951852321
  id1025403665-->id268189549
  id35199649-->id930986246
  id930986246-->id1025403665
  id97846301-->id614824427
  id97846301-->id962147077
  id1070284156-->id1025403665
  id1070284156-->id41381939
  id266353272-->id930986246
  id958243360-->id1025403665
  id614824427-->id1025403665
  id962147077-->id16686930
  id962147077-->id356889899
  id16686930-->id550106276
  id16686930-->id615927850
  id16686930-->id1070284156
  id248638701-->id953615773
  id248638701-->id458148623
  id248638701-->id930986246
  id248638701-->id1070284156
  id385947710-->id458148623
  id385947710-->id930986246
  id385947710-->id1070284156
  id476194349-->id35199649
  id476194349-->id266353272
  id476194349-->id385947710
  id902833893-->id1017323711
  id902833893-->id476194349
  id902833893-->id835658494
  id835658494-->id1070284156
  id835658494-->id363607354
  id356889899-->id958243360
  id356889899-->id248638701
  id356889899-->id902833893
  id363607354-->id798752935
  id363607354-->id1012753001
  id61037662-->id458148623
  id61037662-->id831551540
  id831551540-->id143033156
  id831551540-->id818182390
  id143033156-->id378552737
  id143033156-->id1025403665
  id1012753001-->id61037662
  id818182390-->id930986246
  id745393601-->id667085455
  id667085455-->id951852321
  id667085455-->id268189549
  id41381939-->id445558595
  id360346707-->id745393601
